app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New Blog"], ["text", "First Blog"], ["created_at", "2018-10-12 05:20:14.628283"], ["updated_at", "2018-10-12 05:20:14.628283"]]
---
  def create
    @article = Article.new(params.require(:article).permit(:title, :text))

    @article.save